import React from 'react';
import { Tab } from 'semantic-ui-react';
import CoursesShow from './CoursesShow';

const panes = [
 {
  menuItem: 'ផ្នែកសរសេរគេហទំព័រ',
  render: () => (
   <CoursesShow
    courseType="WebDevelopment"
    header={'បង្កើតគេហទំព័រនិងកម្មវិធីជាមួយការអភិវឌ្ឍន៍គេហទំព័រ'}
    text={
     'ពិភពនៃការអភិវឌ្ឍគេហទំព័រគឺធំទូលាយដូចអ៊ីនធឺណេតដែរ។ ភាគ​ច្រើន​នៃជីវិតសង្គមនិងអាជីពរបស់យើងលេងនៅលើអ៊ិនធរណេតដែលជម្រុញឱ្យឧស្សាហកម្មថ្មីមានគោលបំណងបង្កើតគ្រប់គ្រងនិងកែកំហុសគេហទំព័រនិងកម្មវិធីដែលយើងពឹងផ្អែកកាន់តែខ្លាំងឡើង។'
    }
    url={'/elearning/courses?courseType=WebDevelopment'}
   />
  ),
 },
 {
  menuItem: 'ផ្នែកសរសេរកម្មវិធី',
  render: () => (
   <CoursesShow
    courseType="Programming"
    header={'បង្កើតគេហទំព័រនិងកម្មវិធីជាមួយការអភិវឌ្ឍន៍គេហទំព័រ'}
    text={
     'ពិភពនៃការអភិវឌ្ឍគេហទំព័រគឺធំទូលាយដូចអ៊ីនធឺណេតដែរ។ ភាគ​ច្រើន​នៃជីវិតសង្គមនិងអាជីពរបស់យើងលេងនៅលើអ៊ិនធរណេតដែលជម្រុញឱ្យឧស្សាហកម្មថ្មីមានគោលបំណងបង្កើតគ្រប់គ្រងនិងកែកំហុសគេហទំព័រនិងកម្មវិធីដែលយើងពឹងផ្អែកកាន់តែខ្លាំងឡើង។'
    }
    url={'/elearning/courses?courseType=Programming'}
   />
  ),
 },
 {
  menuItem: 'ផ្នែកប្រព័ន្ធបញ្ចា',
  render: () => (
   <CoursesShow
    courseType="EmbededSystem"
    header={'បង្កើតគេហទំព័រនិងកម្មវិធីជាមួយការអភិវឌ្ឍន៍គេហទំព័រ'}
    text={
     'ពិភពនៃការអភិវឌ្ឍគេហទំព័រគឺធំទូលាយដូចអ៊ីនធឺណេតដែរ។ ភាគ​ច្រើន​នៃជីវិតសង្គមនិងអាជីពរបស់យើងលេងនៅលើអ៊ិនធរណេតដែលជម្រុញឱ្យឧស្សាហកម្មថ្មីមានគោលបំណងបង្កើតគ្រប់គ្រងនិងកែកំហុសគេហទំព័រនិងកម្មវិធីដែលយើងពឹងផ្អែកកាន់តែខ្លាំងឡើង។'
    }
    url={'/elearning/courses?courseType=EmbededSystem'}
   />
  ),
 },
 {
  menuItem: 'ផ្នែកសរសេរកម្មវិធីទូរស័ព្ទដៃ',
  render: () => (
   <CoursesShow
    courseType="MobileDevelopment"
    header={'បង្កើតគេហទំព័រនិងកម្មវិធីជាមួយការអភិវឌ្ឍន៍គេហទំព័រ'}
    text={
     'ពិភពនៃការអភិវឌ្ឍគេហទំព័រគឺធំទូលាយដូចអ៊ីនធឺណេតដែរ។ ភាគ​ច្រើន​នៃជីវិតសង្គមនិងអាជីពរបស់យើងលេងនៅលើអ៊ិនធរណេតដែលជម្រុញឱ្យឧស្សាហកម្មថ្មីមានគោលបំណងបង្កើតគ្រប់គ្រងនិងកែកំហុសគេហទំព័រនិងកម្មវិធីដែលយើងពឹងផ្អែកកាន់តែខ្លាំងឡើង។'
    }
    url={'/elearning/courses?courseType=MobileDevelopment'}
   />
  ),
 },
 {
  menuItem: 'ផ្នែករៀនពីមា៉ស៊ីន',
  render: () => (
   <CoursesShow
    courseType="MachineLearning"
    header={'បង្កើតគេហទំព័រនិងកម្មវិធីជាមួយការអភិវឌ្ឍន៍គេហទំព័រ'}
    text={
     'ពិភពនៃការអភិវឌ្ឍគេហទំព័រគឺធំទូលាយដូចអ៊ីនធឺណេតដែរ។ ភាគ​ច្រើន​នៃជីវិតសង្គមនិងអាជីពរបស់យើងលេងនៅលើអ៊ិនធរណេតដែលជម្រុញឱ្យឧស្សាហកម្មថ្មីមានគោលបំណងបង្កើតគ្រប់គ្រងនិងកែកំហុសគេហទំព័រនិងកម្មវិធីដែលយើងពឹងផ្អែកកាន់តែខ្លាំងឡើង។'
    }
    url={'/elearning/courses?courseType=WebDevelopment'}
   />
  ),
 },
];

const Categories = () => (
 <Tab menu={{ secondary: true, pointing: true }} panes={panes} />
);

export default Categories;
